//HERC01C JOB (COBOL),'ACCTMGMT',CLASS=A,MSGCLASS=X,REGION=4096K,
//         NOTIFY=HERC01
//*
//*********************************************************
//* COMPILE AND EXECUTE COBOL PROGRAM BANKMAIN
//*********************************************************
//*
//* 1. COBOL COMPILATION
//COBCOMP  EXEC PGM=IKFCBL00,
//         PARM='LOAD,NODECK,LIB,SIZE=2048K,QUOTE'
//SYSLIB   DD DSN=HERC01.BANKING.COBOL,DISP=SHR
//SYSIN    DD DSN=HERC01.BANKING.COBOL(ACCTMGMT),DISP=SHR
//SYSLIN   DD DSN=&&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,
//         SPACE=(TRK,(3,3))
//SYSPRINT DD SYSOUT=A
//SYSPUNCH DD DUMMY
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT4   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//*
//*********************************************************
//* 2. LINKAGE EDITOR
//*********************************************************
//LKED     EXEC PGM=HEWL,PARM='LIST,XREF,LET,MAP',COND=(4,LT)
//SYSLIN   DD DSN=&&LOADSET,DISP=(OLD,DELETE)
//SYSLIB   DD DSN=SYS1.COBLIB,DISP=SHR
//         DD DSN=SYS1.LINKLIB,DISP=SHR
//SYSLMOD  DD DSN=HERC01.BANKING.LOAD(ACCTMGMT),DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=A
//*
//*********************************************************
//* EXECUTION OF THE COMPILED PROGRAM
//*********************************************************
//RUNBANK  EXEC PGM=ACCTMGMT
//STEPLIB  DD DSN=HERC01.BANKING.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
1
0000000001
000010000
2
0000000001
000050000
3
0000000001
9
/*
